package official

// Yamen 衙门
type Yamen struct {
	Name  string
	Level int
}

var (
	yamens = []string{
		"京县衙门",
		"布政司衙门",
		"外省衙门",
		"按察司衙门",
		"外县衙门",
		"外府衙门",
		"外州衙门",
		"六部衙门",
		"都察院衙门",
		"九卿衙门",
		"京府衙门",
		"翰林院衙门",
	}

	// "白丁":  {"德": 3, "才": 2, "功": 1, "赃": -1},
	// "童生": {"德": 4, "才": 3, "功": 1, "赃": -1},
	// "案首": {"德": 4, "才": 5, "功": 1, "赃": -1},
	// "监生": {"德": 4, "才": 5, "功": 1, "赃": -1},
	// "秀才": {"德": 5, "才": 6, "功": 4, "赃": 1},
	// "廪生": {"德": 6, "才": 7, "功": 4, "赃": 1},
	// "贡生": {"德": 7, "才": 8, "功": 5, "赃": 1},
	// "举人": {"德": 8, "才": 9, "功": 6, "赃": 1},
	// "解元": {"德": 9, "才": 10, "功": 7, "赃": 1},
	// "进士": {"德": 10, "才": 11, "功": 8, "赃": 1},
	// "会元": {"德": 11, "才": 12, "功": 9, "赃": 1},
	// "传胪": {"德": 12, "才": 13, "功": 10, "赃": 1},
	// "探花": {"德": 13, "才": 14, "功": 11, "赃": 1},
	// "榜眼": {"德": 14, "才": 14, "功": 12, "赃": 1},
	// "状元": {"德": 15, "才": 15, "功": 14, "赃": 1},
)
